<!DOCTYPE html>
<html lang="ar">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>عقد بيع وتسويق منتجات</title>
    <style>
        body {
    font-family: 'Arial', sans-serif;
    direction: rtl;
    text-align: right;
    background-color: #f9f9f9;
    margin: 0;
    padding: 0;
    width: 100%;
}

.contract {
    width: 100%;
    margin: 20px auto;
    padding: 20px;
    background-color: #fff;
    border: 1px solid #ddd; 
}

.contract h1, .contract h2, .contract h3 {
    color: #333;
    text-align: center;
}

.contract p {
    line-height: 1.6;
    margin: 10px 0;
}

.signatures {
    display: flex;
    justify-content: space-between;
    margin-top: 30px;
}

.signature p {
    margin: 5px 0;
    font-weight: bolder;
}
</style>
</head>

<body>
    <div class="contract">
        <h1>عقد بيع وتسويق منتجات</h1>
        <p>انه في يوم :<span style="font-size: 18;font-weight: bold"> {{$day}}</span>  الموافق: <span style="font-size: 18;font-weight: bold"> {{$date}}</span></p>
        <h1 style="text-align: center; width: 100%; display: block;">اتفق كلا من</h1>

        <h2 style="text-align: right;">أولا : شركه بيتر واي Better Way</h2>
        <p>ملف ضريبي رقم: ٥١٠/١١/١١٩٤/٥ ورقم سجل تجاري: ٢٢٦٠٤٤</p>
        <p>والكائن مقرها ١٥٨ شارع الهرم – الجيزة</p>
        <div style="display: flex; justify-content: space-between; align-items: center;">
            <p> ويمثله بالعقد: </p>
            <storng style="font-weight: bold;">(طرف اول - بائع)</storng>
        </div>
        <h2 style="text-align: right;">ثانيا: السيد (ة): {{ $client->ClientNameArabic ?? ''}} <span> .. </span>
            الجنسية: {{ $client->getNationality() ?? ''  }}</h2>
        <p>ويحمل بطاقة/ جواز سفر رقم: {{ $client->ClientNationalID ? $client->ClientNationalID :  $client->ClientPassport }}</p>
        <div style="display: flex; justify-content: space-between; align-items: center;">
            <p>والمقيم: {{ $client->ClientCurrentAddress ?? '' }}</p>
            <storng style="font-weight: bold;"> (طرف ثاني مشتري)</storng>
        </div>

        <p>بعد ان اقر كلا من طرفي هذا العقد بكامل اهليتهما القانونية للتعاقد والتصرف قانونا اتفقا علي الاتي:</p>

        <h3>تمهيد</h3>
        <p>ان شركة بيتر واى تعمل فى مجال الدعاية والاعلان والتسويق ومن منتجاتها هو عضوية بيتر واى و يميز حامله بنسبة خصم
            من مشترياته فى متاجر ومحلات وحيث انها متعاقدة مع هذة المتاجر و المحلات والتى سبق ذكرها وعرضها على الموقع
            الالكترونى <a href="http://betterway-egypt.com" target="_blank">(www.betterway-egypt.com)</a> والابليكشن
            (Better Way)الخاص بالشركة وحيث ان الشركة من ضمن سياستها عند شراء اى عميل لعضوية بيتر واى تعطى له عضوية
            مجانية داخل الشركة وتتيح لة الفرصة لتسويق منتجات الشركة مقابل عموله موضح ذكرها داخل الموقع الالكترونى <a
                href="http://betterway-egypt.com" target="_blank">(www.betterway-egypt.com)</a> والابليكشن (Better Way).
        </p>

        <h3>البند الاول</h3>
        <p>وهذا التمهيد جزء لا يتجزء من العقد.</p>

        <h3>البند الثاني</h3>
        <p>اقر الطرف الثاني بمعاينته الفعلية لمنتج المشتراه وهو على درجه كبيره من الجودة وقبل الشراء برغبته وبحالته
            الراهنة لا المقصد من هذا العقد هو المنتج ذاته وليست السمسرة، حيث ان بيع كافة المنتجات مجرده من أي عيب من
            العيوب التي تبطل العقد.</p>

        <h3>البند الثالث</h3>
        <p>وفي حاله رغبه الطرف الثاني (المشتري) بتوزيع منتجات الطرف الأول (الشركة) يحصل الطرف الثاني علي نسبه سمسره
            مشروعه بواقع ١٪ (واحده في المائة) الي ١٥٪ (خمسه عشر في المائة من حجم المبيعات الفعلية للمنتجات المحددة من
            خلال الطرف الأول (الشركة) ويكون مده العقد سنه ميلاديه تبدأ من تاريخ العقد وهو <span style="font-size: 17px;font-weight: bold">{{ $date }}</span>
            وتجدد لمده
            مماثله اخري تلقائيا بسعر المنتج الجديد على ان يكون العقد بمعرفه الشركة وذلك بناء علي تقييم الشركة للطرف
            الثاني.</p>

        <h3>البند الرابع</h3>
        <p>يقر الطرف الثانى بأنه قد أشترى عضوية (بيتر واى) الخاص بالخصومات على جميع الاماكن المتعاقدة معها الشركه بمبلغ
            قدره <span style="font-size: 17px;font-weight: bold">({{ $client->getPlanProductPrice() }} جنيه)</span>   كما تتيح له الشركه عضوية اخرى مجانيه خاصة بالعمل لكى يعمل
            بها فى بيع العضوية الخاصة بالخصومات بالسمسره المتفق عليها في أعلاه.</p>

        <h3>البند الخامس</h3>
        <p>في حاله رغبه الطرف الثاني ( المشتري) بالقيام بتوزيع المنتجات محل التعاقد يلتزم باظهار المنتج بمظهره الحقيقي
            واطلاع المشتريين عند إتمام الشراء بمعاينه المنتج معاينه حقيقيه فعليه بالاضافه لاقراره بان الثمن المعروض
            مناسب لقيمته الفعليه بالسوق ويعتبر هذا دليلا بانه ليس هناك غرر للمشتري.</p>

        <h3>البند السادس</h3>
        <p>يلتزم الطرف الثاني ( المشتري) في حاله رغبته في التوزيع بالأسعار التي تحددها الشركه للمنتجات المعلن عنها بموقع
            الشركه الالكتروني علي انه يجوز للطرف الأول (الشركه) تخفيض السعر او زيادته حسب متغيرات ومقتضيات واحوال السوق.
        </p>

        <h3>البند السابع</h3>
        <p>في حاله رغبه الطرف الثاني ( المشتري) القيام بالتوزيع تلتزم الشركه بتوفير كافه وسائل الدعايه والاعلان اللازمه
            بتسويق المنتجات سواء كانت مسموعه ام مرئيه ويجوز للطرف الثاني عمل تلك الدعايه تحت رقابه واشراف الطرف الأول (
            الشركه).</p>

        <h3>البند الثامن</h3>
        <p>يحذر علي الطرف الثاني (المشتري) في حاله رغبته بالقيام بتوزيع المنتجات ان ينافس الطرف الأول (الشركه) باي صوره
            من صور التنافس سواء كانت المنافسه بالعرض او بالدعايه او بالتوزيع او باي وسائل اخري.</p>

        <h3>البند التاسع</h3>
        <p>في حاله مخالفه أيا من الالتزامات المتبادله بين الطرفين يعتبر العقد مفسوخا من تلقاء نفسه طبقا لاحكام القانون
            المدني ولا يترتب علي هذا العقد أي مسائله جنائيه.</p>

        <h3>البند العاشر</h3>
        <p>اقر ان الطرف الثاني( الشركه) شرح لى العمل بالعضويه المجانيه بطريقه صحيحه و افهم طريقه العمولات و الدخل بوضوح
            ( وملزم بدفع الضرائب بمعرفتى)وليس من حقى استرداد اموالى تحت اى سبب من الاسباب وقرأت كل الشروط والاحكام
            الخاصه بالشركه وتم عرض نموذج الأعمال بيتر واى لي بالتفصيل كاملا وتم الرد على جميع أسئلتي لارتياحي الكامل
            واوافق على السياسات والإجراءات وأوافق على الامتثال لمدونة قواعد السلوك.</p>

        <h3>البند الحادي عشر</h3>
        <p>لقد بحثت عن هذه الشركه قبل الالتحاق بها وعلمت بكل المجالات التى بها ، كما ان الشركه والعاملين بها لا يوجد
            عليهم اى مسؤليه فى حالت فهمى خطء للشروط والاحكام بها والمسؤليه عليا انا وحدى فقط لا غير ومن حق الشركه الغاء
            عضويتى فى حالة علمهم بانى اسىء بسمعتها او بالعاملين بها باى طريقه من الطرق او بعلمهم بانى التحقت باى شركه
            منافسه لشركتنا وفى حالة تسويق منتجات الشركة وشرح مجالاتها بطريقه غير صحيحه او بطريقه غير المعتاد عليها من حق
            الشركه ان تستبعدني وسحب عضويتي ومن حقها ان تقاضيني قانونيا اذا استدعى الامر كما اعلم ان العمل بالشركه
            اختياريا وليس اجباريا.</p>

        <h3>البند الثاني عشر</h3>
        <p>أي نزاع يثور بشان العقد او تنفيذه او توضيح احد بنوده يكون من اختصاص المحاكم المدنيه بالجيزه بكافه درجاتها.
        </p>

        <h3>البند الثالث عشر</h3>
        <p>يقر كلا من الطرفين العقد بان العنوان الموضح بصدر العقد قرينا علي كل طرف هو موطنا قانونيا له.</p>

        <h3>البند الرابع عشر</h3>
        <p>تحرر هذا العقد من عدد نسختين للعمل بهم عند اللزوم.</p>

       <div class="signatures" style="display: flex; justify-content: space-between;">
    <div class="signature" style="flex: 1;">
        <h3>الطرف الأول (الشركه)</h3>
        <p>الاسم :</p>
        <p>التوقيع :</p>
        <p>رقم القومي :</p>
    </div>
    <div class="signature" style="flex: 1;">
        <h3>الطرف الثاني (المشتري)</h3>
        <p>الاسم :</p>
        <p>التوقيع :</p>
        <p>رقم القومي :</p>
    </div>
</div>

    </div>
</body>

</html>